app/controllers/events_controller.rb

SELECT * FROM `events`
---
  def index
    @events = Event.all

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def show
    @event = Event.find(params[:id])

SELECT * FROM `events` WHERE (`events`.`tag` = 'railssummit') LIMIT 1
---
  def dashboard
    @event = Event.find_by_tag(params[:tag])

INSERT INTO `events` (`updated_at`, `title`, `tag`, `description`, `last_tweet_id`, `created_at`) VALUES('2009-10-13 06:47:11', 'Rails Summit Latin America', 'railssummit', 'This is a twitter trend site for Rails Summit of 2009.', NULL, '2009-10-13 06:47:11')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save