app/controllers/qualifications_controller.rb

SELECT * FROM `qualifications`
---
  def index
    @qualifications = Qualification.all

SELECT * FROM `qualifications` WHERE (`qualifications`.`id` = 1)
---
  def show
    @qualification = Qualification.find(params[:id])

SELECT * FROM `qualifications` WHERE (`qualifications`.`id` = 1)
---
  def edit
    @qualification = Qualification.find(params[:id])

INSERT INTO `qualifications` (`updated_at`, `positive`, `tag`, `created_at`) VALUES('2009-10-13 03:50:42', 1, 'legal', '2009-10-13 03:50:42')
---
  def create
    @qualification = Qualification.new(params[:qualification])

    respond_to do |format|
      if @qualification.save

SELECT * FROM `qualifications` WHERE (`qualifications`.`id` = 1)
UPDATE `qualifications` SET `positive` = 0, `updated_at` = '2009-10-13 03:50:50' WHERE `id` = 1
---
  def update
    @qualification = Qualification.find(params[:id])

    respond_to do |format|
      if @qualification.update_attributes(params[:qualification])